{
	"_meta": {
		"sources": [
			{
				"json": "HaltaracSubraces",
				"abbreviation": "HSR",
				"full": "Haltarac Subraces",
				"authors": [
					"Roaming Yeti"
				],
				"version": "2022-07-12"
			}
		]
	},
	"race": [
		{
			"name": "Half-Elf (Storm)",
			"source": "HaltaracSubraces",
			"ability": [
				{
					"cha": 2,
					"con": 1,
					"str": 1	
				}
			],
			"speed": 30,
			"darkvision": 60,
			"languageProficiencies": [
				{
					"Vallakyn": true,
					"choose": {
						"from": [
							"high Common",
							"low Common"
						],
						"count": 1
					}
				}
			],
			"skillProficiencies": [
				{
					"choose": "any",
					"count": 2
				}
			],
			"size": [
				"M"
			],
			"additionalSpells": [
				{
					"innate": {
						"1": [
							"witch bolt|phb"
						]
					}
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Age",
					"entries": [
						"Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years."
					]
				},
				{
					"type": "entries",
					"name": "Alignment",
					"entries": [
						"The storms of Vallakyr necessitate a pragmatic people, as a result Vallakyns have no alignment tendencies."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium."
					]
				},
				{
					"type": "entries",
					"name": "Darkvision",
					"entries": [
						"Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					]
				},
				{
					"type": "entries",
					"name": "Fey Ancestry",
					"entries": [
					"You have advantage on saving throws against being {@condition charmed}, and magic can't put you to sleep."
					]
				},
				{	
					"type": "entries",
					"name": "Skill Versatility",
					"entries": [
						"You have proficiency in two skills of your choice."
					]
				},
				{
					"type": "entries",
					"name": "Language",
					"entries": [
						"You can speak, read, and write Vallakyn, and either High or Low Common."
					]
				},
				{
					"type": "entries",
					"name": "Lightning Anger",
					"entries": [
						"When in a hostile situation, Vallakyns can lose control of their temper, due to the influence of Aula. In confrontational situations where you are being targeted by a specific creature, make a wisdom saving throw (DC12). On a failed save you cast {@spell Witch Bolt} at first level at the target of your anger. This counts as a suprise round for initiative."
					]
				},
				{
					"type": "entries",
					"name": "Thunderous Laughter",
					"entries": [
						"After a confrontation Vallakyns are quick to make friends. You have advantage on {@skill Persuasion} checks involving those you have previously been in combat with that day."
					]
				}
			]
		}
	]
}